app/controllers/service_controller.rb

def respond_to_CMA_client

	begin

	current_scenario = Rails.application.config.scenario

	logger.debug "****************** Current scenario is: #{current_scenario}**********************"

	received_path = params[:path]

	@scenario = Scenario.find_by(:name=>current_scenario)

	@route = @scenario.routes.find_by(:path=>received_path)
---
SELECT  "scenarios".* FROM "scenarios" WHERE "scenarios"."name" = ? LIMIT 1  [["name", "default24"]]
SELECT  "routes".* FROM "routes" WHERE "routes"."scenario_id" = ? AND "routes"."path" = ? LIMIT 1  [["scenario_id", 2], ["path", "test/test"]]

def set_scenario

	   @scenario = Scenario.find_by(:name=>params[:scenario_name])
---
SELECT  "scenarios".* FROM "scenarios" WHERE "scenarios"."name" = ? LIMIT 1  [["name", "default24"]]